Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/financial_services/financial_products/protection_of_consumers_of_financial_services.html.txt.tmx
Source language: en
Languages: ga

source: Protection of consumers of financial services
ga: Cosaint thomhaltóirí na seirbhísí airgeadais

source: If you have a bank account or a loan with a financial institution, you are a consumer of financial services
ga: Má ta cuntas bainc agat nó iasacht le hinstitiúid airgeadais, is tomhaltóir de sheirbhísí airgeadais tú

source: As a consumer of a financial service you have certain rights
ga: Mar thomhaltóir de sheirbhísí airgeadais, tá cearta ar leith agat

source: As in other areas of consumer law, your rights as a consumer of financial services depend on the contract between you and the financial institution
ga: Mar aon le réimse eile dlí tomhaltóra, braitheann do chuid ceart mar thomhaltóir de sheirbhísí airgeadais ar an gconradh idir tú agus an institiúid airgeadais

source: A contract is an agreement between two or more people that is enforceable by law
ga: Is comhaontú idir beirt nó níos mó atá infhorghníomhaithe le dlí é conradh

source: As with all contracts, your contract with the financial institution consists of stated terms and implied terms
ga: Mar aon le gach conradh, is éard atá i do chonradh leis an institiúid airgeadais ná téarmaí sonraithe agus téarmaí intuigthe

source: Under the European Communities (Unfair Terms in Consumer Contracts) Regulations, 1995 and subsequent amendments in 2000 any term that is found to be unfair to the consumer cannot be enforced
ga: Faoi Rialacháin na gComhphobal Eorpach (Téarmaí Neamhfhéaráilte i gConarthaí Tomhaltóirí), 1995 agus leasúcháin iartheachtacha i 2000 ní féidir le haon téarma a fhaightear go bhfuil sé neamhfhéaráilte don tomhaltóir a bheith forghníomhaithe

source: From June 2010 the Consumer Credit Directive (2008/48/EC) establishes common rules on consumer credit aimed at harmonising certain aspects of the laws, regulations and administrative provisions on consumer credit in the EU
ga: Ó Mheitheamh 2010, bunaíonn an Treoir Chreidmheas Tomhaltais (2008/48/EC) rialacha comónta ar chreidmheas tomhaltais a bhfuil sé mar aidhm acu comhchuibhiú a dhéanamh ar ghnéithe áirithe de dhlíthe, de rialacháin agus d’fhorálacha riaracháin ar chreidmheas tomhaltais san AE

source: The Directive covers personal loans of between €200 and €75,000 repayable after more than a month
ga: Clúdaíonn an Treoir iasachtaí pearsanta de idir €200 agus €75,000 athiníoctha tar éis am níos faide ná mí

source: The Directive does not apply to mortgages or to deferred debit cards
ga: Ní bhaineann an Treoir le morgáistí ná le cártaí dochair iarchurtha

source: You can find further information on the EU's Europa website
ga: Is féidir tuilleadh eolais a fháil ar shuíomh gréasáin Europa an AE

source: Legislation exists that regulates financial institutions dealings with consumers such as the Consumer Credit Act 1995
ga: Tá reachtaíocht ann cheana a rialaíonn gnóthaíocht institiúidí airgeadais le tomhaltóirí ar nós An tAcht um Chreidmheas do Thomhaltóirí, 1995

source: A Consumer Protection Code for financial institutions also exists that prescribes how a financial institution deals with consumers
ga: Tá Cód d’Institiúidí Airgeadais ar Chosaint do Thomhaltóirí ann chomh maith a fhorordaíonn an chaoi a ndéileáileann insitiúidí airgeadais le tomhaltóirí

source: The Central Bank of Ireland is the body that enforces this code and this legislation
ga: Is é Banc Ceannais na hÉireann an comhlacht a fhorghníomhaíonn an cód agus an reachtaíocht seo

source: In order to enforce your rights you need to be aware of what those rights are
ga: Chun do chearta a fhorghníomhú, caithfidh tú a bheith feasach ar céard iad na cearta sin

source: The Competition and Consumer Protection Commission (CCPC) provides information to consumers on their rights and on the costs, risks and benefits of different financial products
ga: Soláthraíonn an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) eolas do thomhaltóirí ar a gcearta agus ar na costais, rioscaí agus leasanna de tháirgí airgeadais dhifriúla

source: This information also helps you to access the financial services that are most suitable to you
ga: Tugann an t-eolas seo cúnamh duit freisin rochtain a fháil ar na seirbhísí airgeadais is oiriúnaí duit

source: The CCPC maintains financial information on its website for consumers
ga: Coinníonn an CCPC suíomh gréasán ar eolas airgeadais do thomhaltóiri

source: Protection for your savings and investments
ga: Cosaint ar do choigiltis agus ar d’infheistíochtaí

source: The Central Bank is responsible for the regulation of the following firms:
ga: Tá Banc Ceannais na hÉireann freagrach as rialúchán na ngnólachtaí a leanas:

source: • Insurance and investment intermediaries (brokers and agents)
ga: • Idirghabhálaithe árachais agus infheistíochta (bróicéirí agus gníomhaithe)

source: • Other retail credit firms
ga: • Gnólachtaí miondíol creidmheasa eile

source: Before dealing with any of these firms, check that they are authorised to trade by the Central Bank
ga: Roimh dhéileáil le haon cheann de na gnólachtaí seo, seiceáil go bhfuil siad údaraithe chun trádáil ag an mBanc Ceannais

source: This authorisation protects you from unscrupulous traders
ga: Cosnaíonn an t-údarú seo tú ó thrádálaithe neamhscrupallacha

source: To check whether the company you are dealing with is authorised, contact the Registers Department of the Central Bank (see 'Where to apply' below)
ga: Chun seiceáil an bhfuil an chuideachta lena bhfuil tú ag déileáil údaraithe, téigh i dteagmháil le Roinn Chlár an Bhanc Cheannais (féach ‘An áit le cur isteach air’ thíos)

source: There are a number of compensation schemes
ga: Tá roinnt scéimeanna cúitimh ann

source: The Deposit Guarantee Scheme compensates consumers for money lost from current and deposit accounts where a bank, building or credit union is unable to return their money due to financial difficulties
ga: Cúitíonn an Scéim Ráthaithe Taisce, bunaithe faoi Rialacháin na gComhphobal Eorpach (Scéim Ráthaithe Taisce) 1995, tomhaltóirí ar airgead a cailleadh ó chuntais reatha agus taisce, áit nach bhfuil banc, cumann forgníochta ná comhar creidmheasa in ann a n-airgead a thabhairt ar ais, mar gheall ar dheacrachtaí airgeadais. Tá an scéim seo maoinithe ag institiúidí creidmheasa údaraithe

source: The European Communities (Deposit Guarantee Schemes) Regulations 2015 replaces the European Communities (Deposit Guarantee Schemes) Regulations 1995 establishing the Scheme
ga: Feidhmíonn scéim chúitimh thír AE eile i gcás bhanc nó institiúid eile údaraithe agus rialaithe i stát AE eile ach atá ag oibriú anseo ar bhonn craoibhe faoi rialacha AE, mura bhfuil sé deimhnithe ag an gcraobh do Rialaitheoir an Bhanc Cheannais go bhfuil sé ar intinn aici a bheith páirteach sa Scéim Chosanta Taiscí

source: The payment process is only initiated once it has been established that the institution cannot return payments made to it due to its financial condition
ga: Tionscantar an próiseas íoctha ach amháin nuair atá sé bunaithe nach bhfuil an institiúid in ann íocaíochtaí a rinneadh a aisíoc mar gheall ar a staid airgeadais

source: The maximum claim per person is 100% of all deposits held by the financial institution up to a maximum of €100,000
ga: Ó 20 Meán Fómhair 2008, is é an t-uaséileamh in aghaidh an duine ná 100% (a bhí 90%) de gach taisce a bhí á choinneáil ag an institiúid airgeadais suas go dtí uasmhéid €100,000 (a bhí €20,000)

source: The compensation scheme of another EU country applies in the case of a bank or financial institution authorised and regulated in another EU state but operating here on a branch basis under EU rules, unless the branch has confirmed to the Central Bank its intention to participate in the Deposit Guarantee Scheme
ga: Ta eolas níos sonraí ar an Scéim Ráthaithe Taisce, chomh maith leis na scéimeanna bainteacha ó thíortha AE eile, ar fáil ar shuíomh gréasáin tomhaltóra an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC)

source: On 30 September 2008 the Government introduced an unlimited Government guarantee for all deposits exceeding €100,000, among other things, in certain Irish banks
ga: Ar 30 Meán Fómhair 2008 thug an Rialtas isteach ráthaíocht neamhtheoranta Rialtais do gach taisce níos mó ná €100,000, i measc nithe eile, i mbainc Éireannacha ar leith

source: The scheme known as the Credit Institutions Financial Support Scheme (CIFS) expired on 29 September 2010
ga: D’easanálaigh an scéim ar a dtugtar an Scéim Thacaíocht Airgeadais Institiúidí Creidmheasa (STAIC) ar 29 Meán Fómhair 2010

source: In December 2009 the Government introduced the Eligible Liabilities Guarantee Scheme (ELG) for term deposit accounts exceeding €100,000 in the same Irish banks
ga: I mí na Nollag 2009, thug an Rialtas isteach an Scéim Ráthaíocht Fhiachais Inghlactha (SRFI) do chuntais thaiscí téarma níos mó ná €100,00 sna bainc Éireannacha céanna

source: The scheme covered term deposits until they matured (up to a maximum five years), provided the bank was covered by the scheme when the deposit was placed
ga: Clúdaíonn an scéim taiscí téarma go dtí go n-aibíonn siad (suas go dtí uasmhéid cúig bliana), ar choinníoll go raibh an banc clúdaithe ag an scéim nuair a cuireadh isteach an taisce

source: If the bank became a member of the scheme after the deposit was placed, the deposit was covered by the CIFS Scheme until 29 September 2010
ga: Má rinneadh ball den scéim den bhanc i ndiaidh gur cuireadh isteach an taisce, clúidaítear an taisce faoin scéim STAIC go dtí 29 Meán Fómhair 2010

source: The ELG scheme also covered on demand current and deposit accounts exceeding €100,000, regardless of when the deposit was placed
ga: Chlúdaigh an scéim RFI cuntais reatha agus taisce ar éileamh a bhfuil níos mó ná €100,000 iontu, is cuma cén uair a cuireadh isteach an taisce

source: Notice accounts were similarly covered provided notice of withdrawl was made before the scheme ended
ga: Clúdaítear cuntais fhógra ar an gcaoi chéanna ar an gcoinníoll go dtugtar fógra aistarraingthe roimh dar críoch an scéim

source: The banks covered by the two schemes were:
ga: Is iad na bancanna abhí clúdaithe ag an dá scéim ná:

source: The ELG scheme ended on 28 March 2013
ga: Chríochnaigh an scéim SRFI ar an 28 Márta 2013

source: If you had a fixed term deposit covered by the scheme before 28 March 2013, the protection of the scheme remains in place until the end of the term, up to a maximum of five years
ga: Má bhí tú taisce téarma sheasta a bhí clúdaithe ag an scéim roimh 28 Márta 2013, beidh cosaint an scéim i bhfeidhm go dtí deireadh an téarma, suas go dtí uasmhéid de chúig bliana

source: This does not affect deposits up to €100,000 which continue to be covered by the Deposit Protection Scheme
ga: Ní chiallaíonn sé seo taiscí difear suas le €100,000 a leanfaidh de bheith clúdaithe ag an Scéim Cosanta Taiscí

source: Further information on the ELG scheme is available on the CCPC's consumer website
ga: Tá tuilleadh eolais ar scéim SRFI ar fáil ar shuíomh gréasáin tomhaltóra an CCPC

source: Some banks that operate in Ireland are regulated in their home country
ga: Tá cuid de na bainc a bhíonn ag oibriú in Éirinn rialaithe ina dtír dhúchais

source: If you have an account in such a bank, you would usually make a claim under the compensation schemes that are in place in the country where the institution is regulated
ga: Ma tá cuntas agat ina leithéid de bhanc, dhéanfá éileamh go hiondúil faoi na scéimeanna cúitimh atá sa tír ina bhfuil an institiúid rialaithe

source: The Investor Compensation Company Ltd (ICCL) operates the Investor Compensation Scheme
ga: Oibríonn an Cuideachta Cúitimh d’Infheisteoirí Teo. (CCIT) an Scéim Chúitimh d’Infheisteoirí

source: The ICCL was set up under the Investor Compensation Act 1998
ga: Cuireadh ar bun an CCIT faoin Acht um Chúiteamh d’Infheisteoirí 1998

source: The purpose of the Scheme is to compensate clients of failed authorised investment firms
ga: Is í cuspóir na Scéime ná cúiteamh a dhéanamh ar chliaint de ghnólachtaí infheistithe údaraithe teipthe

source: If a member firm of the Scheme goes out of business and cannot return your investments or money, you may be entitled to make a claim under the scheme
ga: Má théann ballghnólacht den Scéim as gnó agus nach féidir leo d’infheistíochtaí ná d’airgead a aisíoc, féadfaidh go mbeadh tú i dteideal éileamh a dhéanamh faoin scéim

source: The maximum claim per person is 90% of all deposits held by the financial institution up to a maximum of €20,000
ga: Is é an t-uaséileamh in aghaidh an duine ná 90% de gach taisce atá á choinneáil ag an institiúid airgeadais suas go dtí uasmhéid €20,000

source: Further information on the Investor Compensation Scheme is available on the ICCL website
ga: Tá tuilleadh eolais faoin Scéim Chúitimh d’Infheisteoirí ar fáil ar shuíomh gréasáin an CCIT

source: As a consumer, you should protect your rights and avoid dealing with unregulated financial service providers
ga: Mar thomhaltóir, ba cheart duit do chearta a chosaint agus déileáil a sheachaint le soláthróirí seirbhísí airgeadais neamhrialaithe

source: Who is involved in regulation?
ga: Cé atá bainteach le rialúchán?

source: The Central Bank of Ireland
ga: Banc Ceannais na hÉireann

source: The arrangements for the regulation of the financial services sector have changed considerably in recent years with the most recent changes, implemented under the Central Bank Reform Act 2010, making the Central Bank of Ireland responsible for regulation
ga: Tá athruithe suntasacha tagtha ar rialúchán an earnáil seirbhísí airgeadais le blianta beaga anuas, leis na hathruithe is déanaí, forfheidhmithe faoin Acht Athchóiriú an Bhanc Cheannais 2010, ag fágáil Banc Ceannais na hÉireann freagrach as rialúchán

source: The Central Bank’s Consumer Director has specific responsibility for
ga: Tá freagracht shonrach ag Stiúrthóir Tomhaltais an Bhanc Cheannais as

source: • The protection of consumers and/or investors under a range of legislation including the Consumer Credit Act 1995, the Investment Intermediaries Act 1995, the Stock Exchange Act 1995, the Central Bank Act 1989 and the Insurance Act 1989
ga: • Cosaint tomhaltóirí agus/nó infheisteoirí faoi réimse reachtaíochta ina áirítear an tAcht um Chreidmheas do Thomhaltóirí, 1995, an tAcht um Idirghábhálaithe Infheistíochta 1995, an tAcht Stocmhalartán 1995, an tAcht Bhanc Cheannais na hÉireann 1989 agus an tAcht Árachais 1989

source: • Monitoring the provision of financial services to consumers
ga: • Maoirsiú a dhéanamh ar sholáthar seirbhísí airgeadais do thomhaltóirí

source: The Central Bank appoints the Registrar of Credit Unions who regulates credit unions
ga: Ceapann Banc Ceannais na hÉireann an Cláraitheoir Chomhair Chreidmheasa a rialaíonn comhair chreidmheasa

source: The Registrar is required to inform and assist the Consumer Director in the Central Bank in relation to any complaint about a credit union
ga: Tá ar an gCláraitheoir an Stiúrthóir Tomhaltais sa Bhanc Ceannais a chur ar an eolas agus cúnamh a thabhairt dó i ndáil le haon ghearán faoi chomhar creidmheasa

source: The Central Bank and Financial Services Authority of Ireland Act 2004 provides for the appointment of a statutory Financial Services Ombudsman
ga: Foráileann an tAcht um Bhanc Ceannais agus um Údarás Seirbhísí Airgeadais na hÉireann 2004 do cheapachán Ombudsman um Sheirbhísí Airgeadais reachtúil

source: The scheme is financed by the providers of financial services
ga: Maoiníonn soláthróirí seirbhísí airgeadais an scéim seo

source: The Ombudsman’s role is as an independent mediator dealing with individual complaints against financial services firms
ga: Is é ról an Ombudsman ná mar eadránaí neamhspleách a dhéileáileann le gearáin aonair in aghaidh ghnóthlachtaí seirbhísí airgeadais

source: Complaints must first be made to the financial institution concerned and then to the Ombudsman if you are still dissatisfied
ga: Caithfear gearáin a dhéanamh ar dtús leis an institiúid airgeadais atá i gceist agus ansin leis an Ombudsman má tá tú míshásta fós

source: The Ombudsman provides a mediated solution
ga: Cuireann an tOmbudsman réiteach eadránaithe ar fáil

source: The Ombudsman has the power to order financial institutions to do certain things and to pay compensation
ga: Tá an chumhacht ag an Ombudsman ordú d’institiúidí airgeadais nithe ar leith a dhéanamh agus cúiteamh a íoc

source: Their decisions will generally be binding on the financial institutions (subject to the right of appeal to the High Court)
ga: Tá a gcinntí ceangailteach go ginearálta ar na hinstitiúidí airgeadais (ar choinníoll ceart achomhairc chuig an gCúirt Uachtarach)

source: Read more about the Financial Services Ombudsman's office here
ga: Léigh níos mó faoi oifig an Ombudsman um Sheirbhísí Airgeadais anseo

source: Competition and Consumer Protection Commission
ga: An Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí

source: The Competition and Consumer Protection Commission has statutory responsibility for the regulation of pawnbrokers and credit intermediaries (for example garages that offer finance on new or used cars)
ga: Tá freagrachtaí reachtúla ag an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí do rialúcháin gheallbhróicéirí agus idirghabhálaithe creidmheasa (mar shampla garáistí a ofráileann airgeadas ar cháirr nua agus úsáidte)

source: The office also monitors and investigates complaints in relation to the advertising of credit by credit intermediaries
ga: Déanann an oifig maoirsiú chomh maith agus fiosraíonn sí gearáin i ndáil le fógraíocht creidmheasa ó idirghabhálaithe creidmheasa

source: FIN-NET is an EU-wide out-of-court complaints network for financial services
ga: Is líonra gearáin as-cúirte ar fud an AE é IN-NET do sheirbhísí airgeadais

source: It has been designed particularly to facilitate the out-of-court resolution of consumer disputes when the service provider is established in an EU Member State other than that where the consumer lives
ga: Tá sé deartha go háirithe chun réiteach as-cúirte d’aighnis tomhaltais a éascú nuair atá an soláthróir seirbhíse bunaithe i mBallstát AE seachas an ceann ina gcónaíonn an tomhaltóir

source: Financial fraud has risen in the past few years as criminals seek ways to access personal financial details
ga: Tá calaois airgeadais ardaithe le blianta beaga anuas agus coirpigh ag cuardach bealaí chun rochtain a fháil ar shonraí pearsanta airgeadais

source: Personal financial details include your:
ga: Áirítear i do shonraí pearsanta airgeadais:

source: • Personal identity numbers (PIN) ,
ga: • Uimhreacha aitheantais phearsanta (UAP),

source: • Phone and internet banking details
ga: • Sonraí baincéireachta idirlín agus teileafóin

source: It is very important that you disclose your personal financial details only to reputable traders
ga: Tá sé an-tábhachtach nach nochtann tú do shonraí pearsanta airgeadais ach do thrádálaithe creidiúnacha amháin

source: Criminals have been known to access your personal financial details by impersonating your bank
ga: Tá sé aitheanta go bhfaigheann coirpigh rochtainn ar do shonraí pearsanta airgeadais trí aithris a dhéanamh ar do bhanc

source: Beware of unsolicited letters, e-mails and telephone calls you receive asking you to confirm your personal financial details
ga: Fainic litreacha, ríomhphoist agus glaoanna teileafóin gan iarraidh a fhaigheann tú a iarrann ort do shonraí pearsanta airgeadais a dheimhniú

source: If you receive a letter stating that you have won money from a company that you have never heard of before they may be looking for bank account details
ga: Má fhaigheann tú litir ag rá go bhfuil airgead buaite agat ó chomhlacht nár chuala tú trácht riamh air, d’fhéadfaí go bhfuil siad ag cuardach sonraí cuntais bhainc

source: Never write your personal identity number (PIN) down
ga: Ná scríobh d’uimhir aitheantais phearsanta síos riamh

source: In particular, do not keep this number with your bankcards - memorise it
ga: Go háirithe, ná coinnigh an uimhir seo le do chártaí bainc – foghlaim de ghlanmheabhair í

source: Never disclose your PIN to anyone - your PIN is personal information that your bank would never ask you to state
ga: Ná nocht d’UAP d’aon duine – is eolas pearsanta atá san UAP nach n-iarrfadh do bhanc ort riamh é a lua

source: Your bank may ask you to input your pin to your phone or a PIN terminal at your bank branch or ATM
ga: D’fhéadfaí go n-iarrfadh do bhanc ort d’UAP a chur isteach i do theileafón nó teirminéal UAP ag do chraobh bhainc nó UMB

source: If you have difficulty memorising your PIN you can change it to a number that you can remember
ga: Má tá deacracht agat d’UAP a chur de ghlanmheabhair is féidir leat í a athrú chuig uimhir ar féidir leat smaoineamh uirthi

source: Avoid memorising a number that a criminal might be able to guess - such as a birthday
ga: Seachain uimhir ar féidir le coirpeach í a thomhas – ar nós lá breithe

source: Changing your PIN is easy to do at an Automatic Teller Machine (ATM) or at the bank counter
ga: Tá sé éasca UAP a athrú ag Uathmheasín Bainc (UMB) nó ag an gcúntar bainc

source: Report any lost or stolen cards as soon as you notice them missing
ga: Déan tuairisc ar chártaí caillte nó goidte a luaithe agus a aithníonn tú go bhfuil siad ar iarraidh

source: If you don’t you may be liable for purchases made fraudulently on your card
ga: Mura ndéanann d’fhéadfaí go mbeifeá faoi dhliteanas do cheannacháin déanta go calaoiseach ar do chárta

source: The best way to protect yourself from fraud is to keep your cards and personal financial details secure
ga: Is é an bealach is fearr chun tú féin a chosaint ó chalaois ná do chártaí agus do shonraí pearsanta airgeadais a choinneáil slán

source: In the case of credit cards, a new service - chip and PIN - has been introduced to make credit cards more secure
ga: I gcás cártaí creidmheasa, tá seirbhís nua – slis agus UAP – tugtha isteach chun cártaí creidmheasa a dhéanamh níos sláine

source: If you have a chip and PIN facility on your card (a gold coloured computer chip will be visible on your card) you type in a PIN into the retailers machine instead of signing dockets
ga: Má tá saoráid shlis agus UAP ar do chárta (beidh slis ríomhaire ar dhath an óir feiceálach ar do charta) clóscríobhann tú UAP isteach i meaisín an mhiondíoltóra in áit duillíní a shíniú

source: Never use your credit card PIN or other PIN on the internet or over the phone
ga: Ná húsáid d’UAP cárta creidmheasa ná aon UAP eile riamh ar an idirlíon ná ar an teileafón

source: A frequent financial services scam is where sales persons use high-pressure sales tactics over the telephone, by mail or in person
ga: Is camscéim sheirbhísí airgeadais go minic í nuair a úsáideann díoltóirí taicticí díolacháin d’ardbhrú ar an teileafón, tríd an bpost nó go pearsanta

source: These scams are called ‘boiler rooms operations’ where the sales person put you under pressure to buy worthless or high-risk shares, foreign currency or other investments
ga: Tugtar ‘oibríochtaí seomra coire’ áit a gcuireann an díoltóir faoi bhrú tú chun scaranna gan luach nó d’ardriosca, airgeadra eachtrannach nó infheistíochtaí a cheannach

source: If you are offered an investment deal, check if the financial institution is authorised by the Central Bank by phoning Lo-Call 1890 777 777
ga: Má ofráiltear idirbheart infheistíochta duit, seiceáil an bhfuil an institiúid airgeadais údaraithe ag an mBanc Ceannais trí ghlaoch a chur ar Íos-Ghlao 1890 777 777

source: Particular laws exist to protect you if you are buying products and services by distance selling
ga: Tá dlíthe áirithe ann chun tú a chosaint má cheannaíonn tú táirgí agus seirbhísí trí chiandíol
